genestealer/everblu-meters-esp8266-improved/src/main.cpp
  // Increment total attempts counter
  totalReadAttempts++;

  // Indicate activity with LED
  digitalWrite(LED_BUILTIN, LOW); // Turn on LED to indicate activity

  // Notify MQTT that active reading has started
  mqtt.publish(String(mqttBaseTopic) + "/active_reading", "true", true);
  mqtt.publish(String(mqttBaseTopic) + "/cc1101_state", "Reading", true);

  struct tmeter_data meter_data = get_meter_data(); // Fetch meter data

  // Get current UTC time
  time_t tnow = time(nullptr);
  struct tm *ptm = gmtime(&tnow);
  Serial.printf("Current date (UTC) : %04d/%02d/%02d %02d:%02d/%02d - %ld\n", ptm->tm_year + 1900, ptm->tm_mon + 1, ptm->tm_mday, ptm->tm_hour, ptm->tm_min, ptm->tm_sec, (long)tnow);

  char iso8601[128];
  strftime(iso8601, sizeof iso8601, "%FT%TZ", gmtime(&tnow));

  // Handle data retrieval failure (including first-layer protection rejecting
  // corrupted frames and returning zeros).
  if (meter_data.reads_counter == 0 || meter_data.liters == 0)
  {
    Serial.printf("Unable to retrieve data from meter (attempt %d/%d)\n", _retry + 1, MAX_RETRIES);

    if (_retry < MAX_RETRIES - 1)
    {
      // Schedule retry using callback instead of recursion to prevent stack overflow
      _retry++;
      static char errorMsg[64];
      snprintf(errorMsg, sizeof(errorMsg), "Retry %d/%d - No data received", _retry, MAX_RETRIES);
      lastErrorMessage = errorMsg;
      Serial.printf("Scheduling retry in 10 seconds... (next attempt %d/%d)\n", _retry + 1, MAX_RETRIES);
      mqtt.publish(String(mqttBaseTopic) + "/active_reading", "false", true);
      mqtt.publish(String(mqttBaseTopic) + "/cc1101_state", "Idle", true);
      mqtt.publish(String(mqttBaseTopic) + "/last_error", lastErrorMessage, true);
      digitalWrite(LED_BUILTIN, HIGH); // Turn off LED
      // Use non-blocking callback instead of recursive call
      mqtt.executeDelayed(10000, onUpdateData);
    }
    else
    {
      // Max retries reached, enter cooldown period
      lastFailedAttempt = millis();
      failedReads++;
      lastErrorMessage = "Max retries reached - cooling down";
      Serial.printf("Max retries (%d) reached. Entering 1-hour cooldown period.\n", MAX_RETRIES);
      mqtt.publish(String(mqttBaseTopic) + "/active_reading", "false", true);
      mqtt.publish(String(mqttBaseTopic) + "/cc1101_state", "Idle", true);
      mqtt.publish(String(mqttBaseTopic) + "/status_message", "Failed after max retries, cooling down for 1 hour", true);
      mqtt.publish(String(mqttBaseTopic) + "/last_error", lastErrorMessage, true);

      char buffer[16];
      snprintf(buffer, sizeof(buffer), "%lu", failedReads);
      mqtt.publish(String(mqttBaseTopic) + "/failed_reads", buffer, true);

      snprintf(buffer, sizeof(buffer), "%lu", totalReadAttempts);
      mqtt.publish(String(mqttBaseTopic) + "/total_attempts", buffer, true);
      digitalWrite(LED_BUILTIN, HIGH); // Turn off LED
      _retry = 0;                      // Reset retry counter for next scheduled attempt
    }
    return;
  }

  // Format int time_start and time_end as "HH:MM"
  char timeStartFormatted[6];
  char timeEndFormatted[6];
  int timeStart = constrain(meter_data.time_start, 0, 23); // Ensure valid hour range
  int timeEnd = constrain(meter_data.time_end, 0, 23);     // Ensure valid hour range
  snprintf(timeStartFormatted, sizeof(timeStartFormatted), "%02d:00", timeStart);
  snprintf(timeEndFormatted, sizeof(timeEndFormatted), "%02d:00", timeEnd);

  Serial.printf("Data from meter:\n");
  Serial.printf("Liters : %d\nBattery (in months) : %d\nCounter : %d\nRSSI : %d\nTime start : %s\nTime end : %s\n\n", meter_data.liters, meter_data.battery_left, meter_data.reads_counter, meter_data.rssi, timeStartFormatted, timeEndFormatted);
  Serial.printf("RSSI (dBm) : %d\n", meter_data.rssi_dbm);
  Serial.printf("RSSI (percentage) : %d\n", calculateMeterdBmToPercentage(meter_data.rssi_dbm));
  Serial.printf("Signal quality (LQI) : %d\n", meter_data.lqi);
  Serial.printf("Signal quality (LQI percentage) : %d\n", calculateLQIToPercentage(meter_data.lqi));

  // Publish meter data to MQTT (using char buffers instead of String)
  char valueBuffer[32];

  snprintf(valueBuffer, sizeof(valueBuffer), "%d", meter_data.liters);
  mqtt.publish(String(mqttBaseTopic) + "/liters", valueBuffer, true);
  delay(5);

  // Publish historical data as JSON attributes for Home Assistant
  // This provides 13 months of historical volume readings that can be accessed as attributes
  // in Home Assistant. Each value represents the total volume at the end of that month.
  // The meter stores these internally with timestamps, but the RADIAN protocol only
  // returns the volume values without dates.
  int num_history = 0;
  if (meter_data.history_available)
  {
    // Count valid historical values (non-zero)
    for (int i = 0; i < 13; i++)
    {
      if (meter_data.history[i] == 0)
        break;
      num_history++;
    }

    // If the history block was marked available but contained no
    // non‑zero entries, treat it as unavailable for this frame.
    if (num_history == 0)
    {
      Serial.println("WARN: history_available=true but no non-zero history entries found - skipping history publish for this frame");
      meter_data.history_available = false;
    }
  }

  if (meter_data.history_available)
  {

    Serial.printf("\n=== Historical Data (%d months) ===\n", num_history);
    Serial.println("Month  Volume (L)  Usage (L)");
    Serial.println("-----  ----------  ---------");

    // Calculate monthly consumption from the historical data
    // Format: {"history": [oldest_volume, ..., newest_volume], "monthly_usage": [month1_usage, ..., month13_usage]}
    // The attributes JSON can become relatively large when all 13 history
    // slots are populated. Use a sufficiently large buffer and carefully
    // track remaining space to avoid truncation that would yield malformed
    // JSON on MQTT.
    char historyJson[1024];
    int pos = 0;

    // Start JSON object
    int remaining = sizeof(historyJson) - pos;
    if (remaining <= 1)
    {
      Serial.println("ERROR: historyJson buffer too small before writing header - skipping history publish");
      // Nothing written, just bail out of history publishing for this frame.
      return;
    }
    pos += snprintf(historyJson + pos, remaining, "{\"history\":[");

    // Add historical volumes and print to serial
    for (int i = 0; i < num_history; i++)
    {
      remaining = sizeof(historyJson) - pos;
      if (remaining <= 1)
      {
        Serial.println("ERROR: historyJson buffer full while writing history array - truncating");
        break;
      }
      pos += snprintf(historyJson + pos, remaining, "%s%u",
                      (i > 0 ? "," : ""), meter_data.history[i]);

      // Calculate and display monthly usage
      uint32_t usage = 0;
      if (i > 0 && meter_data.history[i] > meter_data.history[i - 1])
      {
        usage = meter_data.history[i] - meter_data.history[i - 1];
      }
      Serial.printf(" -%02d   %10u  %9u\n", num_history - i, meter_data.history[i], usage);
    }

    // Calculate current month usage (difference from most recent historical reading).
    // Declare these outside of any goto targets to avoid crossing initialisation
    // when jumping to finalize_history_json.
    uint32_t currentMonthUsage = 0;
    uint32_t currentLiters = static_cast<uint32_t>(meter_data.liters);
    if (num_history > 0 && currentLiters > meter_data.history[num_history - 1])
    {
      currentMonthUsage = currentLiters - meter_data.history[num_history - 1];
    }
    Serial.printf("  Now  %10d  %9u (current month)\n", meter_data.liters, currentMonthUsage);
    Serial.println("===================================\n");

    // Add monthly usage calculations to JSON
    remaining = sizeof(historyJson) - pos;
    if (remaining <= 1)
    {
      Serial.println("ERROR: historyJson buffer full before monthly_usage - truncating");
      // Close what we have so far and publish best-effort JSON.
      historyJson[sizeof(historyJson) - 1] = '\0';
      Serial.printf("Publishing JSON attributes (%d bytes): %s\n\n", strlen(historyJson), historyJson);
      mqtt.publish(String(mqttBaseTopic) + "/liters_attributes", historyJson, true);
      delay(5);
      Serial.printf("> Published %d months historical data (current month usage: %u L)\n",
                    num_history, currentMonthUsage);
      goto skip_history_publish;
    }
    pos += snprintf(historyJson + pos, remaining, "],\"monthly_usage\":[");
    for (int i = 0; i < num_history; i++)
    {
      uint32_t usage;
      if (i == 0)
      {
        // For oldest month, we can't calculate usage without an older baseline
        usage = 0;
      }
      else if (meter_data.history[i] > meter_data.history[i - 1])
      {
        // Calculate consumption as difference between consecutive months
        usage = meter_data.history[i] - meter_data.history[i - 1];
      }
      else
      {
        usage = 0; // Sanity check - shouldn't go backwards
      }
      remaining = sizeof(historyJson) - pos;
      if (remaining <= 1)
      {
        Serial.println("ERROR: historyJson buffer full while writing monthly_usage - truncating");
        break;
      }
      pos += snprintf(historyJson + pos, remaining, "%s%u",
                      (i > 0 ? "," : ""), usage);
    }

    remaining = sizeof(historyJson) - pos;
    if (remaining <= 1)
    {
      Serial.println("ERROR: historyJson buffer full before tail - truncating");
      historyJson[sizeof(historyJson) - 1] = '\0';
      Serial.printf("Publishing JSON attributes (%d bytes): %s\n\n", strlen(historyJson), historyJson);
      mqtt.publish(String(mqttBaseTopic) + "/liters_attributes", historyJson, true);
      delay(5);
      Serial.printf("> Published %d months historical data (current month usage: %u L)\n",
                    num_history, currentMonthUsage);
      goto skip_history_publish;
    }
    pos += snprintf(historyJson + pos, remaining,
                    "],\"current_month_usage\":%u,\"months_available\":%d}",
                    currentMonthUsage, num_history);

    // Ensure null termination even if we had to truncate early.
    historyJson[sizeof(historyJson) - 1] = '\0';

    Serial.printf("Publishing JSON attributes (%d bytes): %s\n\n", strlen(historyJson), historyJson);
    mqtt.publish(String(mqttBaseTopic) + "/liters_attributes", historyJson, true);
    delay(5);

    Serial.printf("> Published %d months historical data (current month usage: %u L)\n",
                  num_history, currentMonthUsage);
  }

