genestealer/everblu-meters-esp8266-improved/src/main.cpp
  // Get WiFi details (use String for network functions that return String)
  char wifiIP[16];
  snprintf(wifiIP, sizeof(wifiIP), "%s", WiFi.localIP().toString().c_str());

  int wifiRSSI = WiFi.RSSI();
  int wifiSignalPercentage = calculateWiFiSignalStrengthPercentage(wifiRSSI);

  char macAddress[18];
  snprintf(macAddress, sizeof(macAddress), "%s", WiFi.macAddress().c_str());

  char wifiSSID[33];
  snprintf(wifiSSID, sizeof(wifiSSID), "%s", WiFi.SSID().c_str());

  char wifiBSSID[18];
  snprintf(wifiBSSID, sizeof(wifiBSSID), "%s", WiFi.BSSIDstr().c_str());

  const char *status = (WiFi.status() == WL_CONNECTED) ? "online" : "offline";

  // Uptime calculation
  unsigned long uptimeMillis = millis();
  time_t uptimeSeconds = uptimeMillis / 1000;
  time_t now = time(nullptr);
  time_t uptimeTimestamp = now - uptimeSeconds;
  char uptimeISO[32];
  strftime(uptimeISO, sizeof(uptimeISO), "%FT%TZ", gmtime(&uptimeTimestamp));

  // Publish diagnostic sensors (using char buffers instead of String)
  char valueBuffer[16];
  char topicBuffer[80];

  snprintf(topicBuffer, sizeof(topicBuffer), "%s/wifi_ip", mqttBaseTopic);
  mqtt.publish(topicBuffer, wifiIP, true);
  delay(5);

  snprintf(valueBuffer, sizeof(valueBuffer), "%d", wifiRSSI);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/wifi_rssi", mqttBaseTopic);
  mqtt.publish(topicBuffer, valueBuffer, true);
  delay(5);

  snprintf(valueBuffer, sizeof(valueBuffer), "%d", wifiSignalPercentage);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/wifi_signal_percentage", mqttBaseTopic);
  mqtt.publish(topicBuffer, valueBuffer, true);
  delay(5);

  snprintf(topicBuffer, sizeof(topicBuffer), "%s/mac_address", mqttBaseTopic);
  mqtt.publish(topicBuffer, macAddress, true);
  delay(5);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/ssid", mqttBaseTopic);
  mqtt.publish(topicBuffer, wifiSSID, true);
  delay(5);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/bssid", mqttBaseTopic);
  mqtt.publish(topicBuffer, wifiBSSID, true);
  delay(5);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/status", mqttBaseTopic);
  mqtt.publish(topicBuffer, status, true);
  delay(5);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/uptime", mqttBaseTopic);
  mqtt.publish(topicBuffer, uptimeISO, true);
  delay(5);

  Serial.println("> Wi-Fi details published");
}

// Function: publishMeterSettings
// Description: Publishes meter configuration (year, serial, frequency) to MQTT.
void publishMeterSettings()
{
  Serial.println("> Publish meter settings");

  // Publish Meter Year, Serial (using char buffers instead of String)
  char valueBuffer[16];
  char topicBuffer[80];

  snprintf(valueBuffer, sizeof(valueBuffer), "%d", METER_YEAR);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/water_meter_year", mqttBaseTopic);
  mqtt.publish(topicBuffer, valueBuffer, true);
  delay(5);

  snprintf(valueBuffer, sizeof(valueBuffer), "%u", METER_SERIAL);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/water_meter_serial", mqttBaseTopic);
  mqtt.publish(topicBuffer, valueBuffer, true);
  delay(5);

  // Publish Reading Schedule
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/reading_schedule", mqttBaseTopic);
  mqtt.publish(topicBuffer, readingSchedule, true);
  delay(5);

  // Publish Reading Time (UTC) as HH:MM text (resolved time that may be auto-aligned)
  char readingTimeFormatted[6];
  snprintf(readingTimeFormatted, sizeof(readingTimeFormatted), "%02d:%02d", (int)g_readHourUtc, (int)g_readMinuteUtc);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/reading_time", mqttBaseTopic);
  mqtt.publish(topicBuffer, readingTimeFormatted, true);
  delay(5);

  Serial.println("> Meter settings published");
}

// Function: publishHADiscovery
// Description: Publishes all Home Assistant MQTT discovery messages with serial-specific entity IDs
void publishHADiscovery()
{
  Serial.println("> Publishing Home Assistant discovery messages...");

  char configTopic[128];
  char entityId[64];
  String json;

  // Helper to publish discovery message
  auto publishDiscovery = [&](const char *domain, const char *entity, const String &jsonPayload)
  {
    snprintf(entityId, sizeof(entityId), "%lu_%s", (unsigned long)METER_SERIAL, entity);
    snprintf(configTopic, sizeof(configTopic), "homeassistant/%s/%s/config", domain, entityId);
    mqtt.publish(configTopic, jsonPayload.c_str(), true);
    delay(5);
  };

  // Reading (Total) - Main water sensor
  json = buildDiscoveryJson("Reading (Total)", "water_meter_value", "mdi:water", "L", "water", "total_increasing", nullptr);
  json.replace("\"stat_t\":", "\"stat_t\": \"" + String(mqttBaseTopic) + "/liters\",\n  \"json_attr_t\":");
  json.replace("\"json_attr_t\":", "\"json_attr_t\": \"" + String(mqttBaseTopic) + "/liters_attributes\",\n  \"sug_dsp_prc\":");
  json.replace("\"sug_dsp_prc\":", "\"sug_dsp_prc\": 0,\n  \"qos\":");
  json.replace("\"stat_t\": \"" + String(mqttBaseTopic) + "/water_meter_value\",", "\"stat_t\": \"" + String(mqttBaseTopic) + "/liters\",");
  publishDiscovery("sensor", "water_meter_value", json);

  // Read Counter
  json = buildDiscoveryJson("Read Counter", "water_meter_counter", "mdi:counter", nullptr, nullptr, nullptr, nullptr);
  json.replace("/water_meter_counter\"", "/counter\"");
  publishDiscovery("sensor", "water_meter_counter", json);

  // Last Read (timestamp)
  json = buildDiscoveryJson("Last Read", "water_meter_timestamp", "mdi:clock", nullptr, "timestamp", nullptr, nullptr);
  json.replace("/water_meter_timestamp\"", "/timestamp\"");
  publishDiscovery("sensor", "water_meter_timestamp", json);

  // Request Reading Button
  json = "{\\n";
  json += "  \"name\": \"Request Reading Now\",\\n";
  json += "  \"uniq_id\": \"" + String(METER_SERIAL) + "_water_meter_request\",\\n";
  json += "  \"obj_id\": \"" + String(METER_SERIAL) + "_water_meter_request\",\\n";
  json += "  \"qos\": 0,\\n";
  json += "  \"avty_t\": \"" + String(mqttBaseTopic) + "/status\",\\n";
  json += "  \"cmd_t\": \"" + String(mqttBaseTopic) + "/trigger_force\",\\n";
  json += "  \"pl_avail\": \"online\",\\n";
  json += "  \"pl_not_avail\": \"offline\",\\n";
  json += "  \"pl_prs\": \"update\",\\n";
  json += "  \"frc_upd\": true,\\n";
  json += "  \"dev\": {\\n    " + buildDeviceJson() + "\\n  }\\n";
  json += "}";
  publishDiscovery("button", "water_meter_request", json);

  // Diagnostic sensors
  publishDiscovery("sensor", "water_meter_wifi_ip", buildDiscoveryJson("IP Address", "wifi_ip", "mdi:ip-network-outline", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscovery("sensor", "water_meter_wifi_rssi", buildDiscoveryJson("WiFi RSSI", "wifi_rssi", "mdi:signal-variant", "dBm", "signal_strength", "measurement", "diagnostic"));
  publishDiscovery("sensor", "water_meter_mac_address", buildDiscoveryJson("MAC Address", "mac_address", "mdi:network", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscovery("sensor", "water_meter_wifi_ssid", buildDiscoveryJson("WiFi SSID", "wifi_ssid", "mdi:help-network-outline", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscovery("sensor", "water_meter_wifi_bssid", buildDiscoveryJson("WiFi BSSID", "wifi_bssid", "mdi:access-point-network", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscovery("sensor", "water_meter_uptime", buildDiscoveryJson("Device Uptime", "uptime", nullptr, nullptr, "timestamp", nullptr, "diagnostic"));
  publishDiscovery("sensor", "water_meter_wifi_signal_percentage", buildDiscoveryJson("WiFi Signal", "wifi_signal_percentage", "mdi:wifi", "%", nullptr, "measurement", "diagnostic"));
  publishDiscovery("sensor", "water_meter_reading_time", buildDiscoveryJson("Reading Time (UTC)", "reading_time", "mdi:clock-outline", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscovery("sensor", "water_meter_reading_schedule", buildDiscoveryJson("Reading Schedule", "reading_schedule", "mdi:calendar-clock", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscovery("sensor", "water_meter_year", buildDiscoveryJson("Meter Year", "water_meter_year", "mdi:calendar", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscovery("sensor", "water_meter_serial", buildDiscoveryJson("Meter Serial", "water_meter_serial", "mdi:barcode", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscovery("sensor", "water_meter_battery_months", buildDiscoveryJson("Months Remaining", "battery", "mdi:battery-clock", "months", nullptr, "measurement", nullptr));
  publishDiscovery("sensor", "water_meter_rssi_dbm", buildDiscoveryJson("RSSI", "rssi_dbm", "mdi:signal", "dBm", "signal_strength", "measurement", nullptr));
  publishDiscovery("sensor", "water_meter_rssi_percentage", buildDiscoveryJson("Signal", "rssi_percentage", "mdi:signal-cellular-3", "%", nullptr, "measurement", nullptr));
  publishDiscovery("sensor", "water_meter_lqi_percentage", buildDiscoveryJson("Signal Quality (LQI)", "lqi_percentage", "mdi:signal-cellular-outline", "%", nullptr, "measurement", nullptr));
  publishDiscovery("sensor", "water_meter_time_start", buildDiscoveryJson("Wake Time", "time_start", "mdi:clock-start", nullptr, nullptr, nullptr, nullptr));
  publishDiscovery("sensor", "water_meter_time_end", buildDiscoveryJson("Sleep Time", "time_end", "mdi:clock-end", nullptr, nullptr, nullptr, nullptr));
  publishDiscovery("sensor", "water_meter_total_attempts", buildDiscoveryJson("Total Read Attempts", "total_attempts", "mdi:counter", nullptr, nullptr, "total_increasing", "diagnostic"));
  publishDiscovery("sensor", "water_meter_successful_reads", buildDiscoveryJson("Successful Reads", "successful_reads", "mdi:check-circle", nullptr, nullptr, "total_increasing", "diagnostic"));
  publishDiscovery("sensor", "water_meter_failed_reads", buildDiscoveryJson("Failed Reads", "failed_reads", "mdi:alert-circle", nullptr, nullptr, "total_increasing", "diagnostic"));
  publishDiscovery("sensor", "water_meter_last_error", buildDiscoveryJson("Last Error", "last_error", "mdi:alert", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscovery("sensor", "water_meter_cc1101_state", buildDiscoveryJson("CC1101 State", "cc1101_state", "mdi:radio-tower", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscovery("sensor", "water_meter_freq_offset", buildDiscoveryJson("Frequency Offset", "frequency_offset", "mdi:sine-wave", "kHz", nullptr, nullptr, "diagnostic"));

  // Buttons
  json = "{\\n";
  json += "  \"name\": \"Restart Device\",\\n";
  json += "  \"uniq_id\": \"" + String(METER_SERIAL) + "_water_meter_restart\",\\n";
  json += "  \"obj_id\": \"" + String(METER_SERIAL) + "_water_meter_restart\",\\n";
  json += "  \"qos\": 0,\\n";
  json += "  \"avty_t\": \"" + String(mqttBaseTopic) + "/status\",\\n";
  json += "  \"cmd_t\": \"" + String(mqttBaseTopic) + "/restart\",\\n";
  json += "  \"pl_prs\": \"restart\",\\n";
  json += "  \"ent_cat\": \"config\",\\n";
  json += "  \"dev\": {\\n    " + buildDeviceJson() + "\\n  }\\n";
  json += "}";
  publishDiscovery("button", "water_meter_restart", json);

  json = "{\\n";
  json += "  \"name\": \"Scan Frequency\",\\n";
  json += "  \"uniq_id\": \"" + String(METER_SERIAL) + "_water_meter_freq_scan\",\\n";
  json += "  \"obj_id\": \"" + String(METER_SERIAL) + "_water_meter_freq_scan\",\\n";
  json += "  \"ic\": \"mdi:magnify-scan\",\\n";
  json += "  \"qos\": 0,\\n";
  json += "  \"avty_t\": \"" + String(mqttBaseTopic) + "/status\",\\n";
  json += "  \"cmd_t\": \"" + String(mqttBaseTopic) + "/frequency_scan\",\\n";
  json += "  \"pl_prs\": \"scan\",\\n";
  json += "  \"ent_cat\": \"config\",\\n";
  json += "  \"dev\": {\\n    " + buildDeviceJson() + "\\n  }\\n";
  json += "}";
  publishDiscovery("button", "water_meter_freq_scan", json);

  // Binary sensor for active reading
  json = "{\\n";
  json += "  \"name\": \"Active Reading\",\\n";
  json += "  \"uniq_id\": \"" + String(METER_SERIAL) + "_water_meter_active_reading\",\\n";
  json += "  \"obj_id\": \"" + String(METER_SERIAL) + "_water_meter_active_reading\",\\n";
  json += "  \"dev_cla\": \"running\",\\n";
  json += "  \"qos\": 0,\\n";
  json += "  \"avty_t\": \"" + String(mqttBaseTopic) + "/status\",\\n";
  json += "  \"stat_t\": \"" + String(mqttBaseTopic) + "/active_reading\",\\n";
  json += "  \"pl_on\": \"true\",\\n";
  json += "  \"pl_off\": \"false\",\\n";
  json += "  \"dev\": {\\n    " + buildDeviceJson() + "\\n  }\\n";
  json += "}";
  publishDiscovery("binary_sensor", "water_meter_active_reading", json);

  Serial.println("> Home Assistant discovery messages published");
}

// Function: onConnectionEstablished
// Description: Handles MQTT connection establishment, including Home Assistant discovery and OTA setup.
void onConnectionEstablished()
{
  Serial.println("Connected to MQTT Broker :)");

  Serial.println("> Configure time from NTP server. Please wait...");
  // Note, my VLAN has no WAN/internet, so I am useing Home Assistant Community Add-on: chrony to proxy the time
  configTzTime("UTC0", secret_local_timeclock_server);

