genestealer/everblu-meters-esp8266-improved/src/main.cpp
  delay(5000); // Give it a moment for the time to sync the print out the time
  time_t tnow = time(nullptr);
  struct tm *ptm = gmtime(&tnow);
  Serial.printf("Current date (UTC) : %04d/%02d/%02d %02d:%02d/%02d - %ld\n", ptm->tm_year + 1900, ptm->tm_mon + 1, ptm->tm_mday, ptm->tm_hour, ptm->tm_min, ptm->tm_sec, (long)tnow);
  // Print simple offset and derived local time for debugging
  int offsetMin = TIMEZONE_OFFSET_MINUTES;
  time_t tlocal = tnow + (time_t)offsetMin * 60;
  struct tm *plocal = gmtime(&tlocal);
  Serial.printf("Configured UTC offset: %+d minutes\n", offsetMin);
  Serial.printf("Current date (UTC+offset): %04d/%02d/%02d %02d:%02d/%02d - %ld\n",
                plocal->tm_year + 1900, plocal->tm_mon + 1, plocal->tm_mday,
                plocal->tm_hour, plocal->tm_min, plocal->tm_sec, (long)tlocal);

  // Initialize schedule caches using validated UTC defaults
  updateResolvedScheduleFromUtc(DEFAULT_READING_HOUR_UTC, DEFAULT_READING_MINUTE_UTC);

  Serial.println("> Configure Arduino OTA flash.");
  ArduinoOTA.onStart([]()
                     {
    String type;
    if (ArduinoOTA.getCommand() == U_FLASH) {
      type = "sketch";
    }
    else { // U_FS
      type = "filesystem";
    }
    // NOTE: if updating FS this would be the place to unmount FS using FS.end()
    Serial.println("Start updating " + type); });
  ArduinoOTA.onEnd([]()
                   { Serial.println("\nEnd updating."); });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total)
                        { Serial.printf("%u%%\r\n", (progress / (total / 100))); });
  ArduinoOTA.onError([](ota_error_t error)
                     {
    Serial.printf("Error[%u]: ", error);
    if (error == OTA_AUTH_ERROR) {
      Serial.println("Auth Failed");
    }
    else if (error == OTA_BEGIN_ERROR) {
      Serial.println("Begin Failed");
    }
    else if (error == OTA_CONNECT_ERROR) {
      Serial.println("Connect Failed");
    }
    else if (error == OTA_RECEIVE_ERROR) {
      Serial.println("Receive Failed");
    }
    else if (error == OTA_END_ERROR) {
      Serial.println("End Failed");
    } });
  ArduinoOTA.setHostname("EVERBLUREADER");
  ArduinoOTA.begin();
  Serial.println("> Ready");
  Serial.print("> IP address: ");
  Serial.println(WiFi.localIP());

  char triggerTopic[80];
  snprintf(triggerTopic, sizeof(triggerTopic), "%s/trigger", mqttBaseTopic);
  mqtt.subscribe(triggerTopic, [](const String &message)
                 {
    // Input validation: only accept whitelisted commands
    if (message != "update" && message != "read") {
      Serial.printf("WARN: Invalid trigger command '%s' (expected 'update' or 'read')\n", message.c_str());
      char topicBuffer[80];
      snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
      mqtt.publish(topicBuffer, "Invalid trigger command", true);
      return;
    }
    
    // Check if we're in cooldown period
    if (lastFailedAttempt > 0 && (millis() - lastFailedAttempt) < RETRY_COOLDOWN) {
      unsigned long remainingCooldown = (RETRY_COOLDOWN - (millis() - lastFailedAttempt)) / 1000;
      Serial.printf("Cannot trigger update: Still in cooldown period. %lu seconds remaining.\n", remainingCooldown);
      
      char cooldownMsg[64];
      snprintf(cooldownMsg, sizeof(cooldownMsg), "Cooldown active, %lus remaining", remainingCooldown);
      char topicBuffer[80];
      snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
      mqtt.publish(topicBuffer, cooldownMsg, true);
      return;
    }

    Serial.printf("Update data from meter from MQTT trigger (command: %s)\n", message.c_str());

    _retry = 0;
    onUpdateData(); });

  // Force trigger: an alternate topic that bypasses the cooldown period.
  // This is intended for Home Assistant buttons that should override cooldown.
  char triggerForceTopic[80];
  snprintf(triggerForceTopic, sizeof(triggerForceTopic), "%s/trigger_force", mqttBaseTopic);
  mqtt.subscribe(triggerForceTopic, [](const String &message)
                 {
    // Input validation: accept same commands as the normal trigger
    if (message != "update" && message != "read") {
      Serial.printf("WARN: Invalid force-trigger command '%s' (expected 'update' or 'read')\n", message.c_str());
      char topicBuffer[80];
      snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
      mqtt.publish(topicBuffer, "Invalid trigger command", true);
      return;
    }

    Serial.printf("Force update requested via MQTT (command: %s) - overriding cooldown\n", message.c_str());

    // Immediately attempt to update, ignoring any cooldown state
    _retry = 0;
    onUpdateData(); });

  char restartTopic[80];
  snprintf(restartTopic, sizeof(restartTopic), "%s/restart", mqttBaseTopic);
  mqtt.subscribe(restartTopic, [](const String &message)
                 {
                   // Input validation: only accept exact "restart" command
                   if (message != "restart")
                   {
                     Serial.printf("WARN: Invalid restart command '%s' (expected 'restart')\n", message.c_str());
                     char topicBuffer[80];
                     snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
                     mqtt.publish(topicBuffer, "Invalid restart command", true);
                     return;
                   }

                   Serial.println("Restart command received via MQTT. Restarting in 2 seconds...");
                   char topicBuffer[80];
                   snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
                   mqtt.publish(topicBuffer, "Device restarting...", true);
                   delay(2000);   // Give time for MQTT message to be sent
                   ESP.restart(); // Restart the ESP device
                 });

  char freqScanTopic[80];
  snprintf(freqScanTopic, sizeof(freqScanTopic), "%s/frequency_scan", mqttBaseTopic);
  mqtt.subscribe(freqScanTopic, [](const String &message)
                 {
    // Input validation: only accept "scan" command
    if (message != "scan") {
      Serial.printf("WARN: Invalid frequency scan command '%s' (expected 'scan')\n", message.c_str());
      char topicBuffer[80];
      snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
      mqtt.publish(topicBuffer, "Invalid scan command", true);
      return;
    }
    
    Serial.println("Frequency scan command received via MQTT");
    performFrequencyScan(); });

  Serial.println("> Send MQTT config for HA.");

  // Publish all Home Assistant discovery messages with serial-specific entity IDs
  publishHADiscovery();

  // Set initial state for active reading
  char topicBuffer[80];
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/active_reading", mqttBaseTopic);
  mqtt.publish(topicBuffer, "false", true);
  delay(5);

